# parameters
nc: 10  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [5,6, 8,14, 15,11]  #P2/4
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  #- [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0

   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Conv, [64, 3, 1]],

   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4

   [-1, 1, E_ELAN, [256,0.5]], #4

   [ -1, 1, MPConv, [ 0.5 ] ],
   [ -1, 1, E_ELAN, [ 512, 0.5 ] ],  # 6

   [ -1, 1, MPConv, [ 0.5 ] ],
   [ -1, 1, E_ELAN, [ 1024,0.5 ] ],  # 8

   [ -1, 1, MPConv, [ 0.5 ] ],
   [ -1, 1, E_ELAN, [ 1024,0.25 ] ],  # 10
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 11

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [8, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, E_ELAN_H, [256,0.5,0.25]], #16

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, E_ELAN_H, [128,0.5,0.25]], #21

   #添加P2特征图
   [ -1, 1, Conv, [ 64, 1, 1 ] ],
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
   [ 3, 1, SSFCM, [64] ],
   [ [ -1, -2, 4 ], 1, LW_Fusion, [ 1 ] ],

   [-1, 1, E_ELAN_H, [64,0.5,0.25]], #26

   ###########
   #添加P2特征图
   [ -1, 1, MPConv, [ 1 ] ], # 27
   [ [ -1, 21, 6], 1, BiFPN_Concat3, [ 1 ] ], # 28
   [-1, 1, E_ELAN_H, [128,0.5,0.25]], # 29
   ##########

   [ -1, 1, MPConv, [ 1 ] ], # 30
   [ [11, -1, 8], 1, DFFM, [512] ], # 31
   [-1, 1, E_ELAN_H, [256,0.5,0.25]], # 32


   [26, 1, RepConv, [128, 3, 1]], #33
   [29, 1, RepConv, [256, 3, 1]], #34
   [32, 1, RepConv, [512, 3, 1]], #35

   [[33, 34, 35], 1, IDetect, [nc, anchors]],   # Detect(P2,P3, P4, P5)
  ]
